from pyecharts import options as opts
from pyecharts.charts import Geo
from pyecharts.globals import ChartType, SymbolType


point_list = []
line_list = [('香港', '澳门'), ('澳门', '三亚'), ('三亚', '五指山'), ('五指山', '万宁'), ('万宁', '海口'), ('海口', '广州'),
             ('广州', '深圳'), ('深圳', '惠州'), ('惠州', '汕头'), ('汕头', '福州'), ('福州', '泉州'), ('泉州', '厦门'),
             ('厦门', '龙岩'), ('龙岩', '瑞金'), ('瑞金', '井冈山'), ('井冈山', '南昌'), ('南昌', '温州'), ('温州', '绍兴'),
             ('绍兴', '杭州'), ('杭州', '宁波'), ('宁波', '嘉兴'), ('嘉兴', '上海'), ('上海', '苏州'), ('苏州', '南通'),
             ('南通', '泰州'), ('泰州', '扬州'), ('扬州', '南京'), ('南京', '合肥'), ('合肥', '淮南'), ('淮南', '芜湖'),
             ('芜湖', '绩溪'), ('绩溪', '黄山'), ('黄山', '武汉'), ('武汉', '宜昌'), ('宜昌', '荆州'), ('荆州', '岳阳'),
             ('岳阳', '长沙'), ('长沙', '韶山'), ('韶山', '桂林'), ('桂林', '南宁'), ('南宁', '百色'), ('百色', '昆明'),
             ('昆明', '丽江'), ('丽江', '香格里拉'), ('香格里拉', '贵阳'), ('贵阳', '凯里'), ('遵义', '重庆'), ('重庆', '乌鲁木齐'),
             ('乌鲁木齐', '喀什'), ('喀什', '石河子'), ('石河子', '昌吉回族自治州'), ('昌吉回族自治州', '拉萨'), ('拉萨', '格尔木'), ('格尔木', '西宁'),
             ('西宁', '运城'), ('运城', '平遥'), ('平遥', '太原'), ('太原', '大同'), ('大同', '酒泉'), ('酒泉', '中卫'),
             ('中卫', '吴忠'), ('吴忠', '银川'), ('银川', '延安'), ('延安', '杨凌'), ('杨凌', '咸阳'), ('咸阳', '西安'),
             ('西安', '敦煌'), ('敦煌', '嘉峪关'), ('嘉峪关', '兰州'), ('兰州', '呼和浩特'), ('呼和浩特', '鄂尔多斯'), ('鄂尔多斯', '包头'),
             ('包头', '赤峰'), ('赤峰', '哈尔滨'), ('哈尔滨', '大庆'), ('大庆', '齐齐哈尔'), ('齐齐哈尔', '长春'), ('长春', '松原'),
             ('松原', '吉林'), ('吉林', '延吉'), ('延吉', '沈阳'), ('沈阳', '鞍山'), ('鞍山', '大连'), ('大连', '青岛'),
             ('青岛', '临沂'), ('临沂', '曲阜'), ('曲阜', '泰安'), ('泰安', '济南'), ('济南', '开封'), ('开封', '郑州'),
             ('郑州', '洛阳'), ('洛阳', '安阳'), ('安阳', '石家庄'), ('石家庄', '秦皇岛'), ('秦皇岛', '唐山'), ('唐山', '天津'),
             ('天津', '广安'), ('广安', '乐山'), ('乐山', '成都'), ('成都', '北京')]
# 没有：绩溪、香格里拉、凯里、格尔木、平遥、杨凌、敦煌、延吉、曲阜

for i in line_list:
    point_list.append((i[0], 1))
point_list.append(('北京', 10))

c = Geo(init_opts=opts.InitOpts(width='1200px', height='800px', page_title='地理连线图'))

c.add_coordinate_json(json_file='./data/city.json')
c.add_schema(
    maptype="china",
    itemstyle_opts=opts.ItemStyleOpts(color="#FF3300", border_color="black"),
    )
c.add(
    "",
    point_list,
    type_=ChartType.EFFECT_SCATTER,
    color="white",
    )
c.add(
    "火炬路线",
    line_list,
    type_=ChartType.LINES,
    effect_opts=opts.EffectOpts(
        symbol=SymbolType.ARROW, symbol_size=6, color="yellow"
    ),
    linestyle_opts=opts.LineStyleOpts(curve=0.2, color='yellow'),
    )
c.set_series_opts(label_opts=opts.LabelOpts(is_show=False))
c.set_global_opts(title_opts=opts.TitleOpts(title="08年奥运火炬传递境内路线图"))
c.render("output/geo_line.html")
